{
  "title": "Anuradha Ariyaratne",
  "pages": {
    "Home": {
      "title": "Anuradha Ariyaratne",
      "subTitle": "Senior Lecturer",
      "university": "University of Sri Jayewardenepura",
      "aboutTitle": "About Me",
      "aboutDescriptions": [
        "I am a passionate lecturer and a researcher in the field of computing, specializing in meta-heuristic optimization and machine learning. My research area has mainly comprised of finding promising solutions for different real world optimizations tasks appear in different fields such as Sports, Agriculture, Numerical optimization and many other.",
        "My focus spans a variety of topics ranging from the development of novel meta-heuristic algorithms for optimization problems, the integration of meta-heuristics with machine learning techniques for enhanced predictive modeling, the application of machine learning in hyper-parameter tuning and feature selection, to the exploration of hybrid approaches that combine evolutionary algorithms with deep learning for complex data analysis. In 2019, I was awarded with the President's Awards for Scientific Research, for being among highly impacted 100 research papers in Sri Lanka for the year 2019 under computer science.",
        "Currently I work as a senior lecturer in the Department of Computer Science, University of Sri Jayewardenepura. I earned my PhD in computer science from University of Sri Jayewardenepura, Sri Lanka, under the supervision of Professor TGI Fernando and Emeritus Professor Sunethra Weerakoon.",
        "I’m a fellow of OWSD, founded by UNESCO, from 2022 to present. I am also a life member of SLAAS and SLAAI associations, which are premier organization of Science  and artificial intelligence in Sri Lanka.",
        "From 2018 to 2024, I served as a reviewer for the springer journals; Evolutionary Intelligence and Soft Computing.",
        "To enhance my knowledge further in the field of Data Science, currently I am following a M.Sc. in Data Science in Tampere University, Finland."
      ],
      "interestTitle": "Interests",
      "interests": [
        "Meta-Heuristic Optimization",
        "Nature-Inspired Computing",
        "Machine Learning"
      ],
      "educationTitle": "Education",
      "educations": [
        "PhD in Computer Science, 2018, University of Sri Jayewardenepura, Sri Lanka.",
        "MSc in Data Science, (Reading), Tampere University, Finland.",
        "BSc (Hons) Special Degree in Computer Science, 2012, University of Sri Jayewardenepura, Sri Lanka."
      ]
    }
  },
  "components": {
    "NavigationBar": {
      "title": "Anuradha Ariyaratne",
      "teaching": "Teaching",
      "research": "Research",
      "publications": "Publications",
      "awards": "Awards",
      "experience": "Experience",
      "contact": "Contact",
      "en": "English (en)",
      "si": "Sinhala (si)"
    }
  }
}